[
  {
    "id": 1,
    "categoria": "UA",
    "pergunta": "Sobre a seleção de dados em SQL, analise as afirmativas a seguir e assinale a afirmativa correta.",
    "respostas": [
      "Em uma consulta, na cláusula FROM, deve ser especificado o nome de uma única tabela.",
      "Na cláusula SELECT, é necessário especificar o nome de todos os campos da tabela quando se deseja que todos sejam exibidos.",
      "Dentro da cláusula FROM, ao especificar as tabelas, pode ser colocado um apelido (alias) para as tabelas, inserindo-o logo depois da tabela, separado por espaço.",
      "A cláusula SELECT é a mais importante na seleção de dados, porque pode ser utilizada sozinha.",
      "Na realização de uma consulta SQL, a cláusula FROM pode ser substituída facilmente pela cláusula WHERE, ambas apresentando a mesma função."
    ],
    "respostaCorreta": "Dentro da cláusula FROM, ao especificar as tabelas, pode ser colocado um apelido (alias) para as tabelas, inserindo-o logo depois da tabela, separado por espaço.",
    "justificativa": "Uma consulta básica SQL será sempre formada pelas cláusulas SELECT e FROM. Na cláusula FROM, podem ser colocadas quantas tabelas forem necessárias, sendo possível especificar apelidos (alias)."
  },
  {
    "id": 2,
    "categoria": "UA",
    "pergunta": "Considere um banco relacional, com uma tabela \"Pessoa\", que tem os campos Nome, Telefone, Endereço, Idade e Cidade e com os valores descritos a seguir (Imagem: https://statics-marketplace.plataforma.grupoa.education/sagah/b74bd243-0937-4c6c-b52f-c223cec2e829/d91391f6-fc4b-48a5-8253-d504b7761059.jpg ). Analise as afirmativas a seguir e assinale a única correta.",
    "respostas": [
      "O comando SELECT * FROM Pessoa irá retornar as linhas 1, 2, 3, 4.",
      "O comando SELECT * FROM Pessoa WHERE cidade = null irá retornar a linha 5.",
      "O Comando SELECT nome * FROM Pessoa WHERE Cidade like 'Marau, Passo Fundo' irá retornar as linhas 1,2,3 e 4.",
      "O Comando SELECT * FROM Pessoa WHERE Cidade not in ('Marau', 'Passo Fundo') irá retronar apenas a linha 1e 5.",
      "O Comando SELECT * FROM Pessoa WHERE Cidade like (Marau, Passo Fundo) irá retornar as linhas 1,2,3 e 4."
    ],
    "respostaCorreta": "O Comando SELECT * FROM Pessoa WHERE Cidade not in ('Marau', 'Passo Fundo') irá retronar apenas a linha 1e 5.",
    "justificativa": "Para usar uma lista de valores, deve ser utilizado o operador IN (ou NOT IN), e os valores devem ser colocados entre aspas simples. O operador = não funciona com NULL (deveria ser IS NULL)."
  },
  {
    "id": 3,
    "categoria": "UA",
    "pergunta": "Considerando a tabela a seguir (Imagem: https://statics-marketplace.plataforma.grupoa.education/sagah/95fac8a0-9d5c-43f5-a2bd-e6205cdcc547/5c07c9af-909e-44dc-ac27-309fb488690f.jpg ), analise as afirmativas e selecione a que contém o SQL correto que irá retornar APENAS as linhas 1 e 2.",
    "respostas": [
      "https://statics-marketplace.plataforma.grupoa.education/sagah/dc02a08b-a6a1-4b8e-b9fc-751191a8bfa3/71430e1c-e4af-4bdc-89c2-025534811316.jpg",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/940d3041-8988-4469-a471-4f7f38229a8e/f6396ed9-e77d-4e68-8db0-0080e95faeb9.jpg",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/f756bf67-1d43-4ab2-a2eb-cebf4b5f7457/f9816779-fb43-4d63-ae8a-46f5ec67f6dc.jpg",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/796761bf-e19e-4fcb-8258-f0970c77f25d/f15562e7-8c02-42d5-8c7c-3f82daab2307.jpg",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/49fde780-a2a5-4f4f-8368-37a9fde241dc/917736a0-21b0-4f4f-a65d-478cca6f3d7e.jpg"
    ],
    "respostaCorreta": "https://statics-marketplace.plataforma.grupoa.education/sagah/dc02a08b-a6a1-4b8e-b9fc-751191a8bfa3/71430e1c-e4af-4bdc-89c2-025534811316.jpg",
    "justificativa": "Utilizando BETWEEN, o SQL irá retornar os valores que estão em um intervalo de dados (inclusive). Como as únicas cidades entre 150.000 e 200.000 habitantes são Curitiba e Passo Fundo, essa consulta retorna as linhas 1 e 2."
  },
  {
    "id": 4,
    "categoria": "UA",
    "pergunta": "Analisando a tabela a seguir (Imagem: https://statics-marketplace.plataforma.grupoa.education/sagah/fb286264-e7ef-4d09-b229-00064508befa/5976ad30-fd17-45b4-ab76-d39ec11e027a.jpg ) e as afirmativas subsequentes, selecione a afirmativa que contém a consulta SQL necessária para trazer os alunos aprovados (considere aprovados alunos com nota superior a 7) nascidos a partir de 1991 e que não tiraram nenhuma nota abaixo de 6.",
    "respostas": [
      "https://statics-marketplace.plataforma.grupoa.education/sagah/7cea7e0f-3142-4683-8104-95f4f231e967/64c79eb9-bc64-4e8a-a8f7-27bfb93b326f.jpg",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/15a51f6e-267e-41f8-9e84-e10f5cda2e71/11908bd9-ee10-440b-af1d-5a2e4223ce07.jpg",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/04578717-25ea-422b-adb0-857688d16c55/42cc1bd6-dcd0-43b9-897b-cf1758c3137f.png",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/e723e5f9-63af-417e-92dc-961b0a8267f8/9549d85f-f4a3-4f55-8a6f-6b68053000bc.png",
      "https://statics-marketplace.plataforma.grupoa.education/sagah/c93178bc-17e9-4328-aeaf-2714ea777030/f02eac38-7db3-4027-a38d-2e9d1b8e1739.jpg"
    ],
    "respostaCorreta": "https://statics-marketplace.plataforma.grupoa.education/sagah/c93178bc-17e9-4328-aeaf-2714ea777030/f02eac38-7db3-4027-a38d-2e9d1b8e1739.jpg",
    "justificativa": "É necessário usar media >= 7 para aprovados, AND anoNasc >= 1991 para o ano, e verificar as três notas individualmente com >= 6 (nota1 >= 6 AND nota2 >= 6 AND nota3 >= 6)."
  },
  {
    "id": 5,
    "categoria": "UA",
    "pergunta": "Considere a tabela a seguir e, com base nela, assinale a afirmativa que contém a(s) fruta(s) que irá(ão) retornar para a seguinte consulta SQL: SELECT * FROM frutas WHERE preco BETWEEN 2.5 AND 3 AND unidade = 'kg' AND nome LIKE '%ca%'; (Imagem da Tabela: https://statics-marketplace.plataforma.grupoa.education/sagah/ee221cae-8aed-401b-814a-00542d14662e/61816080-5648-4d8c-a0c6-9764b77f7bf3.jpg )",
    "respostas": [
      "Apenas abacate.",
      "Abacate, caju e caqui.",
      "Abacate e caju.",
      "Caju e caqui.",
      "Caqui e caju."
    ],
    "respostaCorreta": "Abacate e caju.",
    "justificativa": "O BETWEEN filtra frutas com preços entre 2,5 e 3. A unidade 'kg' elimina o caqui. O LIKE '%ca%' exige que o nome tenha a sílaba 'ca', o que permite abacate e caju."
  },
  {
    "id": 6,
    "categoria": "UA",
    "pergunta": "Considerada uma das operações mais utilizadas, bem como a forma para a combinação de informações de duas ou mais relações, o join em uma instrução SQL refere-se a uma:",
    "respostas": [
      "restrição.",
      "junção.",
      "deleção.",
      "inserção.",
      "alteração."
    ],
    "respostaCorreta": "junção.",
    "justificativa": "Um join é um cruzamento entre tabelas; assim, é representado pela junção entre tabelas."
  },
  {
    "id": 7,
    "categoria": "UA",
    "pergunta": "O PostgreSQL é um sistema de gerenciamento de banco de dados de uso geral e objeto-relacional. Dos vários tipos de operação de junção no PostgreSQL, a junção NATURAL é um tipo especial de qual operação de junção?",
    "respostas": [
      "LEFT.",
      "RIGHT.",
      "INNER.",
      "OUTER.",
      "FULL."
    ],
    "respostaCorreta": "INNER.",
    "justificativa": "A junção NATURAL é um tipo especial de operação de junção INNER que retorna registros das tabelas do PostgreSQL, agrupando-os de acordo com um código relacionado."
  },
  {
    "id": 8,
    "categoria": "UA",
    "pergunta": "Considerando as tabelas: Funcionarios(funcionario_nome, funcionarios_cod) e Setores(setores_nome, setores_codigo, funcionarios_cod). Deseja-se apresentar o resultado: Resultado(funcionarios_cod, setores_codigo, funcionario_nome, setores_nome). Qual instrução SQL atende a essa demanda?",
    "respostas": [
      "SELECT * FROM departamentos LEFT JOIN funcionarios.",
      "SELECT * FROM setores NATURAL JOIN funcionarios.",
      "SELECT * FROM setores.",
      "SELECT * FROM funcionarios.",
      "SELECT nome, funcionario_cod FROM setores NATURAL JOIN funcionarios."
    ],
    "respostaCorreta": "SELECT * FROM setores NATURAL JOIN funcionarios.",
    "justificativa": "A SELECT * FROM setores NATURAL JOIN funcionarios apresenta a instrução correta para cruzar os dados."
  },
  {
    "id": 9,
    "categoria": "UA",
    "pergunta": "Na instrução SQL apresentada: 'SELECT * FROM cidade INNER JOIN regiao ON cidade.codigo_regiao = regiao.codigo_regiao', qual cláusula é opcional?",
    "respostas": [
      "SELECT.",
      "FROM.",
      "INNER.",
      "JOIN.",
      "ON."
    ],
    "respostaCorreta": "INNER.",
    "justificativa": "A única cláusula opcional na instrução SQL é a INNER, pois, na junção interna, ela já é definida por padrão."
  },
  {
    "id": 10,
    "categoria": "UA",
    "pergunta": "Uma junção natural consiste da criação de relação implícita com base nos mesmos nomes de atributos em duas tabelas. Portanto, qual símbolo representa a operação específica de junção em banco de dados relacional?",
    "respostas": [
      "σ (sigma).",
      "⋈.",
      "π.",
      "÷.",
      "∪."
    ],
    "respostaCorreta": "⋈.",
    "justificativa": "O ⋈ (borboleta/gravata borboleta) representa o Join (junção)."
  },
  {
    "id": 11,
    "categoria": "UA",
    "pergunta": "Com o uso de LEFT, todas as linhas da tabela da esquerda que não têm correspondentes na tabela da direita são acrescidas no resultado da consulta. Considerando a instrução abaixo, selecione as partes ausentes na cláusula JOIN para unir as duas tabelas Pedidos e Clientes, usando o campo cod_cliente em ambas: SELECT * FROM Pedidos LEFT JOIN Clientes ON ____________;",
    "respostas": [
      "Clientes = Pedidos",
      "Clientes.codigo = Pedidos.codigo",
      "Pedidos.cod_cliente = Clientes.cod_cliente",
      "Pedidos.cod_cliente <> Clientes.cod_cliente",
      "Pedidos_cod_cliente = Pedidos"
    ],
    "respostaCorreta": "Pedidos.cod_cliente = Clientes.cod_cliente",
    "justificativa": "Para que a junção esquerda seja validada, é necessário que os campos idênticos nas duas tabelas sejam explicitados após a cláusula ON, neste caso: Pedidos.cod_cliente = Clientes.cod_cliente."
  },
  {
    "id": 12,
    "categoria": "UA",
    "pergunta": "Escolha a cláusula JOIN correta, que preencha a linha, para selecionar todos os registros da tabela Clientes, mais todas as correspondências na tabela Pedidos: SELECT * FROM Pedidos _____ Clientes ON Pedidos.cliente_ID = Clientes.cliente_ID;",
    "respostas": [
      "LEFT JOIN",
      "FULL JOIN",
      "RIGHT JOIN",
      "INNER JOIN",
      "CROSS JOIN"
    ],
    "respostaCorreta": "RIGHT JOIN",
    "justificativa": "RIGHT JOIN apresenta todos os elementos da tabela direita (neste caso, Clientes) e suas correspondências na tabela da esquerda."
  },
  {
    "id": 13,
    "categoria": "UA",
    "pergunta": "Há um JOIN que produz um conjunto de resultados que contém todas as linhas da tabela direita, com as linhas correspondentes da tabela esquerda. Se não houver correspondência, o lado esquerdo conterá valores nulos. A qual junção a afirmação se refere?",
    "respostas": [
      "INNER.",
      "FULL.",
      "CROSS.",
      "LEFT.",
      "RIGHT."
    ],
    "respostaCorreta": "RIGHT.",
    "justificativa": "A junção externa direita (RIGHT) produz um conjunto de resultados com todas as linhas da tabela direita, com as linhas correspondentes da tabela esquerda."
  },
  {
    "id": 14,
    "categoria": "UA",
    "pergunta": "Considerando a instrução SQL \"SELECT * FROM estado FULL OUTER JOIN municipio USING (cod_estado);\", qual termo é considerado opcional?",
    "respostas": [
      "SELECT.",
      "FROM.",
      "FULL.",
      "OUTER.",
      "JOIN."
    ],
    "respostaCorreta": "OUTER.",
    "justificativa": "Para representar uma junção externa, utiliza-se a cláusula OUTER, porém opcionalmente, uma vez que o que caracteriza as junções externas são as cláusulas LEFT, RIGHT e FULL."
  },
  {
    "id": 15,
    "categoria": "UA",
    "pergunta": "A relação (ALUNO-DISCIPLINA) é o resultado da execução de uma junção específica (Imagem: https://statics-marketplace.plataforma.grupoa.education/sagah/2478c28c-e88c-4301-8782-019d55f4a973/73e6c970-1334-4f80-882b-7d5f5731357e.png). Qual é essa junção?",
    "respostas": [
      "LEFT OUTER JOIN.",
      "RIGHT OUTER JOIN.",
      "FULL OUTER JOIN.",
      "INNER JOIN.",
      "NATURAL JOIN."
    ],
    "respostaCorreta": "FULL OUTER JOIN.",
    "justificativa": "A junção externa correspondente à relação (ALUNO-DISCIPLINA) que retorna o resultado apresentado é FULL OUTER JOIN, em que são apresentadas todas as tuplas das duas tabelas relacionadas."
  },
  {
    "id": 16,
    "categoria": "UA",
    "pergunta": "Em um contexto geral, o Data Lake representa um repositório para grandes quantidades de dados. Portanto, pode-se afirmar que o Data Lake é:",
    "respostas": [
      "uma tecnologia para Big Data.",
      "um pântano de dados dentro de Big Data.",
      "uma linguagem de programação.",
      "um banco de dados relacional.",
      "um software para Big Data."
    ],
    "respostaCorreta": "uma tecnologia para Big Data.",
    "justificativa": "Um Data Lake é um conceito dentro de Big Data e, portanto, uma tecnologia. Não é um software único, nem linguagem de programação ou banco relacional."
  },
  {
    "id": 17,
    "categoria": "UA",
    "pergunta": "O Apache Hadoop apresenta um ecossistema de tecnologias que auxiliam no gerenciamento de dados. Quais dos nomes a seguir fazem parte desse ecossistema (como ferramentas auxiliares)?",
    "respostas": [
      "Hadoop Common e Hadoop Data Map.",
      "Hadoop Code e Hadoop Yarn.",
      "Apache Spark e Apache Sqoop.",
      "Hadoop MapReduce e Hadoop Data Start.",
      "HDFS e Hadoop Point."
    ],
    "respostaCorreta": "Apache Spark e Apache Sqoop.",
    "justificativa": "Fazem parte do ecossistema as tecnologias: Apache Sqoop e Apache Spark. Componentes como Common, MapReduce e HDFS são partes do próprio Hadoop, não ferramentas do ecossistema externo."
  },
  {
    "id": 18,
    "categoria": "UA",
    "pergunta": "Uma das ferramentas que ganhou mais notoriedade nos últimos anos é o Apache Spark. Qual é o seu diferencial?",
    "respostas": [
      "O Apache Spark tem como diferencial o uso da escrita em memória, em vez de fazer várias chamadas ao disco rígido, aumentando sua velocidade no processamento dos dados.",
      "O Apache Spark tem como diferencial ser um framework gratuito, visto que não há muitas tecnologias desse porte disponíveis gratuitamente no mercado de Data Science.",
      "O Apache Spark tem como diferencial uma comunicação efetiva com o framework Hadoop, fazendo com que o processamento dos dados seja privilegiado.",
      "O Apache Spark tem como diferencial o processamento em paralelo de gigantescas e massivas quantidades de dados.",
      "O Apache Spark tem como diferencial o armazenamento de dados, além do processamento."
    ],
    "respostaCorreta": "O Apache Spark tem como diferencial o uso da escrita em memória, em vez de fazer várias chamadas ao disco rígido, aumentando sua velocidade no processamento dos dados.",
    "justificativa": "O Apache Spark faz chamadas à memória, evitando ficar acionando o disco rígido a todo momento, o que aumenta a velocidade."
  },
  {
    "id": 19,
    "categoria": "UA",
    "pergunta": "As camadas do ecossistema de Big Data são responsáveis por cuidar de todo o processo que um dado percorre. Quais são essas camadas?",
    "respostas": [
      "Camada fontes de dados, camada armazenamento, camada manipulação e camada consumo.",
      "Camada armazenamento, camada salvar, camada análise, camada consumo e camada segurança.",
      "Camada fontes de dados, camada armazenamento, camada análise e camada impressão.",
      "Camada ingestão, camada armazenamento, camada processamento, camada apresentação e camada segurança.",
      "Camada Data Lake, camada armazenamento, camada ingestão e camada consumo."
    ],
    "respostaCorreta": "Camada ingestão, camada armazenamento, camada processamento, camada apresentação e camada segurança.",
    "justificativa": "As camadas do ecossistema de Big Data são: camada ingestão, camada armazenamento, camada processamento, camada apresentação e camada segurança."
  },
  {
    "id": 20,
    "categoria": "UA",
    "pergunta": "Data Lake e Data Warehouse apresentam diferenças significativas em seus conceitos. Qual é a única coisa que ambos têm em comum?",
    "respostas": [
      "Ambos tratam exclusivamente de dados semiestruturados.",
      "Ambos são projetados para atuação específica de profissionais da área de negócios.",
      "Ambos são plataformas de armazenamento de código compartilhado similar ao Github.",
      "Ambos são estruturas de execução de linguagens de programação orientadas a objetos.",
      "Ambos funcionam como repositórios para grandes quantidades de dados."
    ],
    "respostaCorreta": "Ambos funcionam como repositórios para grandes quantidades de dados.",
    "justificativa": "A única coisa que o Data Lake e o Data Warehouse têm em comum é a capacidade de armazenamento de grandes conjuntos de dados."
  },
  {
    "id": 21,
    "categoria": "UA",
    "pergunta": "Os dados podem ser considerados recursos ativos gerados automaticamente em toda atividade exercida; se tratados e analisados têm grande valor para o mercado. Assinale a alternativa que contempla a definição correta sobre o dado.",
    "respostas": [
      "É uma quantidade de fatos não analisados.",
      "Fornece significado contextualizado.",
      "Pode ser definido como uma experiência.",
      "O seu sentido é estabelecido quando apresentado só.",
      "São ativos tecnológicos padronizadores."
    ],
    "respostaCorreta": "É uma quantidade de fatos não analisados.",
    "justificativa": "Os dados representam uma sequência de fatos que ainda não passaram por análise."
  },
  {
    "id": 22,
    "categoria": "UA",
    "pergunta": "Assinale a alternativa que apresenta os passos percorridos pelo dado durante seu uso na tomada de decisões corporativas.",
    "respostas": [
      "Tratamento, armazenamento, análise.",
      "Armazenamento, análise, coleta e tratamento.",
      "Coleta dos dados, armazenamento, tratamento e análise.",
      "Análise, tratamento e armazenamento.",
      "Tratamento, análise e coleta."
    ],
    "respostaCorreta": "Coleta dos dados, armazenamento, tratamento e análise.",
    "justificativa": "Primeiro ocorre a coleta, posteriormente eles são armazenados, tratados e, por fim, analisados."
  },
  {
    "id": 23,
    "categoria": "UA",
    "pergunta": "A ciência de dados traz a multidisciplinaridade para o mundo dos dados, e, agindo em conjunto com tecnologias e ferramentas Big Data, pode contribuir para a geração e diversificação de novos negócios. Assinale a alternativa que traz algum princípio relacionado ao uso destes recursos.",
    "respostas": [
      "Permite o armazenamento dos dados antigos como critério para aprovação de investimentos em novas ferramentas.",
      "O Big Data permite que dados sejam armazenados e utilizados após muitos anos, sem perder o valor.",
      "Ferramentas e tecnologias Big Data são gratuitas e geram redução de custos para empresa.",
      "A ciência dos dados aplica conceitos estatísticos nos dados em conjunto com tecnologias Big Data.",
      "As tomadas de decisão dentro de uma empresa podem ser baseadas em análises primitivas dos dados com planilhas."
    ],
    "respostaCorreta": "A ciência dos dados aplica conceitos estatísticos nos dados em conjunto com tecnologias Big Data.",
    "justificativa": "Além de dados estatísticos, a ciência de dados aplica o refinamento, a mineração, o armazenamento e a visualização dos dados."
  },
  {
    "id": 24,
    "categoria": "UA",
    "pergunta": "Assinale a alternativa que contém formas de como as empresas obtêm os dados de seus clientes para uso da ciência de dados e Big Data.",
    "respostas": [
      "Por meio de abordagens pessoais em centros comerciais.",
      "Por meio de correspondências.",
      "Por meio de preenchimento de formulários em planilhas.",
      "Por meio de ligações realizadas pelos call centers das empresas para seus clientes.",
      "Por meio de aplicações de terceiros, identificação de dispositivo, perfil do usuário."
    ],
    "respostaCorreta": "Por meio de aplicações de terceiros, identificação de dispositivo, perfil do usuário.",
    "justificativa": "O monitoramento dos dados dos usuários é feito por meio de aplicações de terceiros, mecanismos de busca, softwares especializados, cookies, dentre outros."
  },
  {
    "id": 25,
    "categoria": "UA",
    "pergunta": "Assinale a alternativa que traz formas de como as empresas fazem uso dos dados de seus usuários para obter sucesso em seus negócios.",
    "respostas": [
      "Para realizar compras em seus cadastros.",
      "Fornecimento de serviços personalizados.",
      "Para obter dados aleatórios que circulam na rede.",
      "Para manter a preferência do cliente.",
      "Para aplicar recurso de reconhecimento facial."
    ],
    "respostaCorreta": "Fornecimento de serviços personalizados.",
    "justificativa": "As empresas utilizam as análises para notificações, serviços de geolocalização, conteúdos personalizados e integração de contas."
  }
]

